export const profileData = [
  {
    label: 'name',
    desc: '문희연',
  },
  {
    label: 'birth',
    desc: '1991년 11월 14일',
  },
  {
    label: 'phone',
    desc: '010-7557-0533',
  },
  {
    label: 'email',
    desc: 'yeon7513@gmail.com',
  },
  {
    label: 'address',
    desc: '대전 대덕구 송촌로37번길 2',
  },
];

export const infomationData = [
  {
    title: '학력',
    content: [
      {
        date: '2009. 05. 13.',
        label: '대입검정고시',
        desc: '고등학교졸업',
      },
    ],
  },
  {
    title: '경력',
    content: [
      {
        date: '2017. 03. 20. - 2017. 11. 19',
        label: '로드피아',
        desc: '사원 / 고객응대 및 온라인 쇼핑몰 관리',
      },
      {
        date: '2010. 09. 01. - 2011. 04. 31',
        label: '(주) 충남일보',
        desc: '사원 / 신문기사 편집디자인',
      },
    ],
  },
  {
    title: '자격증',
    content: [
      {
        date: '2023. 12.',
        label: '웹디자인기능사',
      },
      {
        date: '2011. 12.',
        label: '컴퓨터그래픽스운용기능사',
      },
      {
        date: '2010. 10.',
        label: '전자출판기능사',
      },
    ],
  },
  {
    title: '교육/연수',
    content: [
      {
        date: '2024. 04. 15. - 2024. 10. 08.',
        label: '[기업주도형] 데이터시각화 UI 개발자',
        desc: 'DW아카데미학원',
      },
      {
        date: '2023. 06. 29. - 2023. 12. 22.',
        label: '한 번에 끝내는 프론트엔드 개발자',
        desc: '세잔IT직업전문학교',
      },
      {
        date: '2010. 03. 02. - 2010. 08. 24.',
        label: '옵셋인쇄',
        desc: '대우직업전문학교',
      },
    ],
  },
];

export const stackData = [
  {
    skill: 'HTML5',
    desc: '웹 표준을 준수하고, 기본적인 마크업을 지키며 시멘틱 엘리먼트를 적절히 활용하여 웹 페이지를 구성할 수 있습니다. 또한, 웹 사이트의 호환성, 접근성, 검색 엔진 최적화 등 다양한 측면에서 효과적인 웹디자인을 제공할 수 있습니다.',
    keyword: ['#자신있어요', '#웹표준 준수', '접근성 고려'],
  },
  {
    skill: 'CSS3',
    desc: 'HTML을 기반으로 스타일과 동적인 효과를 구현할 수 있습니다. 웹페이지의 시각적인 디자인과 사용자 경험을 향상시킬 수 있으며, 다양한 디바이스와 환경에서 호환성을 유지하는 웹 디자인을 제공할 수 있습니다.',
    keyword: ['#자신있어요', '#반응형 디자인', '#Flexbox', '#Grid레이아웃'],
  },
  {
    skill: 'SCSS',
    desc: '변수, 믹스인, 중첩 규칙 등 고급 기능을 활용하여 코드의 재사용성을 높이고, 모듈화 기능을 통해 대규모 프로젝트에서도 일관된 스타일을 유지할 수 있습니다.',
    keyword: [
      '#자신있어요',
      '#변수 사용',
      '#믹스인',
      '#모듈화',
      '#반응형 디자인',
    ],
  },
  {
    skill: 'JavaScript',
    desc: '다양한 메서드와 기능을 이용하여 동적인 효과를 구현해 낼 수 있습니다. 이를 통해 웹 페이지의 상호작용성과 사용자 경험을 향상시킬 수 있으며, 다양한 웹 프로젝트에서 효과적인 기능을 개발할 수 있습니다.',
    keyword: ['#잘할수있어요', '#비동기처리', '#DOM조작'],
  },
  {
    skill: 'jQuery',
    desc: '간단한 이벤트 핸들링과 DOM 요소 조작을 할 수 있습니다. 주로 선택자를 사용하여 특정 요소를 선택하고, 클릭 이벤트와 같은 단순한 상호작용을 구현할 수 있습니다.',
    keyword: ['#조금할수있어요', '#간단한 이벤트핸들링'],
  },
  {
    skill: 'React JS',
    desc: '상태 관리 및 컴포넌트 라이프사이클을 다루고, Hooks를 활용한 함수형 컴포넌트 개발이 가능합니다. 또한, 복잡한 애플리케이션에서 효율적인 상태 관리를 위해 Context API나 Redux를 사용할 수 있습니다.',
    keyword: [
      '#잘할수있어요',
      '#상태관리',
      '#컴포넌트라이프사이클',
      '#Hooks활용',
    ],
  },
  {
    skill: 'Firebase',
    desc: 'Firebase를 사용하여 기본적인 실시간 데이터베이스 설정과 인증 기능을 구현할 수 있습니다.',
    keyword: ['#조금할수있어요', '#실시간 데이터베이스', '#기본 인증'],
  },
  {
    skill: 'MySQL',
    desc: '기본적인 SQL 쿼리 작성을 통해 데이터 조회, 삽입, 업데이트, 삭제 등의 작업을 수행할 수 있습니다.',
    keyword: ['#조금할수있어요', '#기초SQL쿼리'],
  },
  {
    skill: 'Visual Studio Code',
    desc: '텍스트 입력 방식의 편집기를 사용하여 웹 코딩과 프론트엔드 프레임워크를 구현하고 구축할 수 있습니다. 또한, 다양한 웹 프로젝트에서 효과적이고 품질 높은 개발을 수행 할 수 있습니다.',
    keyword: ['#자신있어요', '#Emmet활용', '#확장플러그인설정'],
  },
  {
    skill: 'PhotoShop',
    desc: '다양한 툴과 기능을 활용하여 이미지 편집과 보정 작업을 할 수 있습니다. 색상 및 밝기 조정, 이미지 합성, 레이어 관리 등 다양한 작업을 통해 고퀄리티의 이미지를 제작할 수 있으며, 디자인 요구에 맞게 상세한 조정이 가능합니다.',
    keyword: ['#잘할수있어요', '#색감 조정', '#이미지 합성'],
  },
  {
    skill: 'Illustrator',
    desc: '다양한 도구를 활용하여 벡터 그래픽을 제작하고 편집할 수 있습니다. 텍스트와 도형 작업, 패스 조작, 레이어 관리 등을 통해 복잡한 디자인을 구현할 수 있습니다.',
    keyword: ['#잘할수있어요', '#텍스트 디자인', '#도형 및 패스 작업'],
  },
];
